app/controllers/posts_controller.rb

 	def create
 		@post = Post.new(post_params)
 		if @post.save
---
INSERT INTO "posts" ("username", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Vasya"], ["title", "123"], ["body", "qwertyuiop"], ["created_at", "2018-10-12 17:25:34.831145"], ["updated_at", "2018-10-12 17:25:34.831145"]]